Revit 2027 API
ScheduleDefinition.HasEmbeddedSchedule Property
 Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasEmbeddedSchedule { get; }
Public ReadOnly Property HasEmbeddedSchedule As Boolean
	Get
public:
property bool HasEmbeddedSchedule {
	bool get ();
}
member HasEmbeddedSchedule : bool with get
Property Value
Boolean
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace